export default function AgreementTHContent() {
    return <div className=" font-prompt">
            <p>ยินดีต้อนรับสู่ระบบสมาชิก CRM เพื่อการสะสมคะแนน แลกรับของรางวัล และสิทธิพิเศษต่างๆ เพื่อให้การบริการเป็นไปอย่างมีประสิทธิภาพ โปรดอ่านและยอมรับเงื่อนไขดังต่อไปนี้:</p>
            <h3 className="font-bold mt-4">1. การเข้าร่วมเป็นสมาชิก</h3>
            <p>ในการใช้งานระบบ ท่านตกลงยินยอมให้ข้อมูลส่วนบุคคลเบื้องต้นแก่ผู้ให้บริการ ได้แก่:</p>
            <ul className="list-disc pl-10">
              <li>ชื่อ-นามสกุล</li>
              <li>หมายเลขโทรศัพท์</li>
              <li>อีเมล (E-mail)</li>
              <li>เดือน/ปี เกิด</li>
              <li>เพศสภาพ</li>
              <li>ที่อยู่ในการจัดส่งสินค้า ของรางวัล คูปอง และสิทธิประโยชน์ต่างๆ สำหรับสมาชิก</li>
              <li>จังหวัดหรือเขตพื้นที่</li>
              <li>ข้อมูลอื่นๆ ที่อาจจำเป็นสำหรับการระบุตัวตนและสิทธิประโยชน์</li>
            </ul>


            <h3 className="font-bold mt-4">2. วัตถุประสงค์ในการเก็บรวบรวมและใช้ข้อมูล</h3>
            <p>ผู้ให้บริการจะใช้ข้อมูลของท่านเพื่อวัตถุประสงค์ดังนี้:</p>

            <ul className="list-disc pl-10">
              <li>เพื่อใช้ในการยืนยันตัวตนสมาชิก และการสะสม/แลกคะแนนสะสม (Points)</li>
              <li>เพื่อการแลกรับของรางวัล และคูปองส่วนลดต่างๆ รวมถึงสิทธิประโยชน์อื่นๆ สำหรับสมาชิก</li>
              <li>เพื่อติดต่อสื่อสาร แจ้งข่าวสาร และนำเสนอโปรโมชันที่เหมาะสมกับความสนใจของท่าน</li>
              <li>เพื่อวัตถุประสงค์ทางการตลาดและการมอบสิทธิประโยชน์ที่ตรงใจ</li>
            </ul>

            <h3 className="font-bold mt-4">3. การเปิดเผยข้อมูลภายในกลุ่มธุรกิจ (Data Sharing)</h3>
            <p>ท่านรับทราบและ ยินยอม ให้ผู้ให้บริการสามารถแบ่งปัน (Share) ข้อมูลส่วนบุคคลของท่านให้กับ กลุ่มธุรกิจอำพลฟูดส์ (Ampol Group) และบริษัทในเครือหรือบริษัทที่เกี่ยวข้อง เพื่อวัตถุประสงค์ในการวิเคราะห์ข้อมูล การทำวิจัยตลาด และการดำเนินกิจกรรมทางการตลาดแบบบูรณาการ เพื่อให้ท่านได้รับสิทธิประโยชน์และข้อเสนอที่ดียิ่งขึ้นจากทุกธุรกิจในเครือ</p>

            <h3 className="font-bold mt-4">4. การคุ้มครองข้อมูลส่วนบุคคล (PDPA)</h3>
            <ul className="list-disc pl-10">
              <li>ผู้ให้บริการจะจัดเก็บข้อมูลของท่านไว้เป็นความลับและมีมาตรการรักษาความปลอดภัยที่เหมาะสม</li>
              <li>ท่านมีสิทธิ์ในการขอตรวจสอบ แก้ไข หรือขอยกเลิก (ถอนความยินยอม) ในการเก็บรวมรวมข้อมูลและรับข่าวสารทางการตลาดได้ทุกเมื่อ ผ่านช่องทางที่ผู้ให้บริการกำหนด</li>
            </ul>

            <h3 className="font-bold mt-4">5. การเชื่อมต่อบัญชีกับผู้ให้บริการภายนอก (Third-Party Providers)</h3>
            <p>เพื่อให้ท่านได้รับความสะดวกในการใช้งานระบบสมาชิก ท่านสามารถเลือกเชื่อมต่อบัญชีสมาชิกกับผู้ให้บริการรายอื่นได้ ดังนี้:</p>
            <ul className="list-disc pl-10">
              <li>ช่องทางที่รองรับ: LINE Official Account (LINE OA), Google Account และ Facebook Account</li>
              <li>เพื่อใช้ในการยืนยันตัวตนและเข้าสู่ระบบสมาชิกได้อย่างรวดเร็วโดยไม่ต้องจดจำรหัสผ่านใหม่</li>
              <li>เพื่อใช้เป็นช่องทางในการส่งข้อมูลการสะสมคะแนน, การยืนยันการแลกรับสิทธิ์, คูปองส่วนลด, และการแจ้งเตือนสิทธิประโยชน์อื่นๆ ผ่านช่องทางที่ท่านได้ทำการเชื่อมต่อไว้ (เช่น การแจ้งเตือนผ่าน LINE)</li>
              <li>ผู้ให้บริการจะได้รับข้อมูลพื้นฐานที่จำเป็นตามที่ท่านได้ให้ความยินยอมไว้กับผู้ให้บริการรายนั้นๆ (เช่น ชื่อโปรไฟล์, รูปภาพโปรไฟล์, และอีเมล) ทั้งนี้ ท่านสามารถเลือกยกเลิกการเชื่อมต่อบัญชีได้ทุกเมื่อผ่านการตั้งค่าในระบบสมาชิกหรือผ่านทางผู้ให้บริการรายนั้นๆ โดยตรง</li>
              <li></li>
            </ul>


            <h3 className="font-bold mt-4">6. การเปลี่ยนแปลงเงื่อนไข</h3>
            <p>ผู้ให้บริการขอสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขการใช้บริการ สิทธิประโยชน์ และรายการของรางวัล โดยจะแจ้งให้ทราบล่วงหน้าผ่านช่องทางประกาศของระบบ</p>
          </div>
}